// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   DecompressStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell decompress command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_DECOMPRESS_PROTOCOL_NOT_FOUND	#language eng  "%hs: Decompress Protocol not found\n"

#string STR_DECOMPRESS_ZERO_ARG				#language eng  "%hs: Argument with zero length is not allowed\n"

#string STR_DECOMPRESS_FIRST_MULT_FILES		#language eng  "%hs: First argument cannot be multiple files\n"

#string STR_DECOMPRESS_FIRST_ARG_DIR		#language eng  "%hs: First argument cannot be a directory\n"

#string STR_DECOMPRESS_SECOND_MULT_FILES	#language eng  "%hs: Second argument cannot be multiple files\n"

#string STR_DECOMPRESS_SECOND_DIR			#language eng  "%hs: Second argument cannot be a directory\n"

#string STR_DECOMPRESS_OUT_OF_MEM			#language eng  "%hs: Out of memory\n"

#string STR_DECOMPRESS_READ_ERROR			#language eng  "%hs: Read %hs error - %r\n"

#string STR_DECOMPRESS_COMPRESSED_DAMAGED	#language eng  "%hs: Compressed file %hs has damaged - %r\n"

#string STR_DECOMPRESS_ERROR				#language eng  "%hs: Decompress %hs error - %r\n"

#string STR_DECOMPRESS_WRITE_ERROR			#language eng  "%hs: Write %hs error - %r\n"

#string STR_DECOMPRESS_CREATE_ERROR			#language eng  "%hs: Create %hs error - %r\n"

#string STR_DECOMPRESS_SUCCESS				#language eng  "%hs: '%hs' successfully decompressed to '%hs'\n"

#string STR_EFIDECOMPRESS_LINEHELP	   #language eng  "Decompress a file"

#string STR_EFIDECOMPRESS_VERBOSEHELP  #language eng  "Decompress a file.\n"
                                                      "\n"
                                                      "EFIDECOMPRESS infile outfile\n"
                                                      "\n"
                                                      "    infile   - Filename of compressed input file\n"
                                                      "    outfile  - Filename of decompressed output file\n"
